<h1> Lista de Maiores e Menores </h1>
<br>
<i>
• Importar biblioteca pandas <br>
• Importar um arquivo Excel<br>
• Exibir uma tabela com os 3 funcionários mais velhos<br>
• Exibir uma tabela com os 4 funcionários mais novos <br>    
• Criar uma lista com Todos os funcionários do sexo masculino<br>
• Exibir uma tabela com os 2 homens mais velhos<br>
• Exibir uma tabela com os 2 homens mais novos<br>
• Criar uma lista com Todos os funcionários do sexo feminino<br>
• Exibir uma tabela com os 3 mulheres mais velhas<br>
• Exibir uma tabela com os 3 mulheres mais novas<br>
• Lista de todos os analistas<br>  
• Exibir uma tabela com os 3 analistas mais velhos<br>
• Exibir uma tabela com os 2 analistas mais novos<br>

In [43]:
import pandas as pd
dataset = pd.read_excel('funcionarios.xlsx', sheet_name='Funcionários')

display(dataset.head(4))

print('Linhas e Colunas')
dataset.shape

  Funcionários                       Função  Idade Sexo
0       Arthur           Cientista de Dados     32    M
1        Pedro           Arquiteto de Dados     24    M
2        Maria  Analista  de Sistema Senior     25    F
3        Lucas   Analista  de Sistema Pleno     29    M

Linhas e Colunas

(17, 4)

<h3> Os 3 funcionários mais velhos </h3>

In [44]:
dataset.nlargest(3,'Idade')

   Funcionários                   Função  Idade Sexo
10       Karina  Desenvolvedor FullStack     47    F
7      Vinicius                      DBA     43    M
6        Marcos                  Gerente     42    M

<h3> Os 4 funcionários mais novos </h3>

In [45]:
dataset.nsmallest(4,'Idade')

  Funcionários                       Função  Idade Sexo
9      Eduardo       Desenvolvedor Back End     19    M
8        Celia      Desenvolvedor Front End     21    F
1        Pedro           Arquiteto de Dados     24    M
2        Maria  Analista  de Sistema Senior     25    F

<h3> Lista com todos os funcionários do sexo masculino </h3>

In [72]:
homens = dataset.loc[dataset['Sexo']=='M']

display(homens.head(4))
#dataset.loc[ dataset.groupby('Sexo')['Idade'].idxmax()]

  Funcionários                      Função  Idade Sexo
0       Arthur          Cientista de Dados     32    M
1        Pedro          Arquiteto de Dados     24    M
3        Lucas  Analista  de Sistema Pleno     29    M
4         João     Analista  de Sistema Jr     33    M

<h3> Os dois homens mais velhos </h3>

In [76]:
homens_velhos = homens.nlargest(2,'Idade')
display(homens_velhos)

  Funcionários   Função  Idade Sexo
7     Vinicius      DBA     43    M
6       Marcos  Gerente     42    M

<h3> Os dois homens mais novos </h3>

In [77]:
homens_novos = homens.nsmallest(2,'Idade')
display(homens_novos)

  Funcionários                  Função  Idade Sexo
9      Eduardo  Desenvolvedor Back End     19    M
1        Pedro      Arquiteto de Dados     24    M

<h3> Lista com todos os funcionários do sexo feminino </h3>

In [79]:
mulheres = dataset.loc[dataset['Sexo']=='F']
display(mulheres)

   Funcionários                       Função  Idade Sexo
2         Maria  Analista  de Sistema Senior     25    F
8         Celia      Desenvolvedor Front End     21    F
10       Karina      Desenvolvedor FullStack     47    F
11       Sandra          Analista de Suporte     34    F
12        Marta  Analista de Infra-Estrutura     40    F
13      Luciana  Analista  de Sistema Senior     27    F
16     Nathalia       Tecnico de Informática     39    F

<h3> As três mulheres mais velhas </h3>

In [81]:
mulheres_velhas = mulheres.nlargest(3,'Idade')
display(mulheres_velhas)

   Funcionários                       Função  Idade Sexo
10       Karina      Desenvolvedor FullStack     47    F
12        Marta  Analista de Infra-Estrutura     40    F
16     Nathalia       Tecnico de Informática     39    F

<h3> As três mulheres mais novas </h3>

In [82]:
mulheres_novas = mulheres.nsmallest(3,'Idade')
display(mulheres_novas)

   Funcionários                       Função  Idade Sexo
8         Celia      Desenvolvedor Front End     21    F
2         Maria  Analista  de Sistema Senior     25    F
13      Luciana  Analista  de Sistema Senior     27    F

<h3> Lista de todos os analistas </h3>

In [85]:
analistas = dataset[dataset['Função'].str.contains("Analista")]
display(analistas)

   Funcionários                       Função  Idade Sexo
2         Maria  Analista  de Sistema Senior     25    F
3         Lucas   Analista  de Sistema Pleno     29    M
4          João      Analista  de Sistema Jr     33    M
11       Sandra          Analista de Suporte     34    F
12        Marta  Analista de Infra-Estrutura     40    F
13      Luciana  Analista  de Sistema Senior     27    F
14      Gabriel   Analista  de Sistema Pleno     35    M
15     Anderson      Analista  de Sistema Jr     26    M

<h3> Os três analistas mais velhos </h3>

In [86]:
analista_experiente = analistas.nlargest(3,'Idade')
display(analista_experiente)

   Funcionários                       Função  Idade Sexo
12        Marta  Analista de Infra-Estrutura     40    F
14      Gabriel   Analista  de Sistema Pleno     35    M
11       Sandra          Analista de Suporte     34    F

<h3> Os dois analistas mais novos </h3>

In [87]:
analista_novato = analistas.nsmallest(2,'Idade')
display(analista_novato)

   Funcionários                       Função  Idade Sexo
2         Maria  Analista  de Sistema Senior     25    F
15     Anderson      Analista  de Sistema Jr     26    M